# CLI tools
brew 'awscli'
brew 'aws-okta'
cask 'aws-vault'
brew 'chruby'
brew 'fasd'
brew 'fzf'
brew 'gnupg'
brew 'hub'
brew 'jq'
brew 'mas'
brew 'node-build'
brew 'pinentry-mac'
brew 'pv'
brew 'pstree'
brew 'ruby-install'
brew 'terraform'
brew 'watch'

# External taps
tap 'tkareine/homebrew-chnode'
brew 'chnode'

# Apps
cask '1password'
cask 'bartender'
cask 'daisydisk'
cask 'dash'
cask 'paw'
cask 'sequel-pro'
cask 'shift'
cask 'the-clock'
cask 'visual-studio-code'

# Hack system font
tap 'homebrew/cask-fonts'
cask 'homebrew/cask-fonts/font-hack-nerd-font'

# Utilities
tap 'bradfeehan/formulae'
brew 'resize-dock-external-monitor'
brew 'aws-vault-exec-wrapper'

# Mac App Store
mas '1Blocker', id: 1365531024
mas 'Amphetamine', id: 937984704
mas 'iStat Menus', id: 1319778037
mas 'Stay', id: 435410196
mas 'Weather Widget Desktop +', id: 1201214408
mas 'Yubico Authenticator', id: 1497506650
