# CLI tools
brew 'awscli'
brew 'aws-okta'
cask 'aws-vault'
brew 'chruby'
brew 'fasd'
brew 'hub'
brew 'mas'
brew 'pv'
brew 'pstree'
brew 'ruby-install'
brew 'terraform'
brew 'watch'

# Apps
cask '1password'
cask 'bartender'
cask 'dash'
cask 'little-snitch'
cask 'messenger'
cask 'the-clock'
cask 'visual-studio-code'

# Hack system font
tap 'caskroom/fonts'
cask 'caskroom/fonts/font-hack'

# Utilities
tap 'bradfeehan/formulae'
brew 'resize-dock-external-monitor'
brew 'aws-vault-exec-wrapper'

# Mac App Store
mas 'Amphetamine', id: 937984704
mas 'Australian Weather', id: 489725673
mas 'Stay', id: 435410196
