# CLI tools
brew 'awscli'
brew 'aws-okta'
cask 'aws-vault'
brew 'chnode'
brew 'chruby'
brew 'fasd'
brew 'hub'
brew 'jq'
brew 'mas'
brew 'node-build'
brew 'pv'
brew 'pstree'
brew 'ruby-install'
brew 'terraform'
brew 'watch'

# Apps
cask '1password'
cask 'bartender'
cask 'daisydisk'
cask 'dash'
cask 'paw'
cask 'sequel-pro'
cask 'shift'
cask 'the-clock'
cask 'visual-studio-code'

# Hack system font
tap 'caskroom/fonts'
cask 'caskroom/fonts/font-hack'

# Utilities
tap 'bradfeehan/formulae'
brew 'resize-dock-external-monitor'
brew 'aws-vault-exec-wrapper'

# Mac App Store
mas '1Blocker for Safari', id: 1107421413
mas 'Amphetamine', id: 937984704
mas 'Stay', id: 435410196
